In [1]:
#Pandas => Panel data
import numpy as np
import pandas as pd

In [2]:
column = ['w','x','y','z']
index = ['a','b','c','d','e']

from numpy.random import randint

In [3]:
np.random.seed(42)
data = randint(-100,100,(5,4))

In [4]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [5]:
df  = pd.DataFrame(data,index,column) #capitalize the f in frame

In [6]:
df

    w   x   y   z
a   2  79  -8 -86
b   6 -29  88 -80
c   2  21 -26 -13
d  16  -1   3  51
e  30  49 -48 -99

In [8]:
df['y'] #grab a column

a    -8
b    88
c   -26
d     3
e   -48
Name: y, dtype: int32

In [9]:
type(df['y'])

pandas.core.series.Series

In [10]:
df[['y','w']]

    y   w
a  -8   2
b  88   6
c -26   2
d   3  16
e -48  30

In [11]:
df['new'] = df['w'] + df['y'] #adding a column

In [12]:
df

    w   x   y   z  new
a   2  79  -8 -86   -6
b   6 -29  88 -80   94
c   2  21 -26 -13  -24
d  16  -1   3  51   19
e  30  49 -48 -99  -18

In [13]:
df.drop('new',axis=1) #Dropping a column

    w   x   y   z
a   2  79  -8 -86
b   6 -29  88 -80
c   2  21 -26 -13
d  16  -1   3  51
e  30  49 -48 -99

In [14]:
df

    w   x   y   z  new
a   2  79  -8 -86   -6
b   6 -29  88 -80   94
c   2  21 -26 -13  -24
d  16  -1   3  51   19
e  30  49 -48 -99  -18

In [15]:
df  = df.drop('new',axis=1)

In [16]:
df

    w   x   y   z
a   2  79  -8 -86
b   6 -29  88 -80
c   2  21 -26 -13
d  16  -1   3  51
e  30  49 -48 -99

In [17]:
df.loc['a'] #loc means row

w     2
x    79
y    -8
z   -86
Name: a, dtype: int32

In [18]:
df.iloc[0]

w     2
x    79
y    -8
z   -86
Name: a, dtype: int32

In [19]:
df.iloc[0:3]

   w   x   y   z
a  2  79  -8 -86
b  6 -29  88 -80
c  2  21 -26 -13

In [20]:
df.drop('b')

    w   x   y   z
a   2  79  -8 -86
c   2  21 -26 -13
d  16  -1   3  51
e  30  49 -48 -99

In [23]:
df.loc[['a','c'],'w']

a    2
c    2
Name: w, dtype: int32

In [24]:
df>0

      w      x      y      z
a  True   True  False  False
b  True  False   True  False
c  True   True  False  False
d  True  False   True   True
e  True   True  False  False

In [25]:
df[df>0]

    w     x     y     z
a   2  79.0   NaN   NaN
b   6   NaN  88.0   NaN
c   2  21.0   NaN   NaN
d  16   NaN   3.0  51.0
e  30  49.0   NaN   NaN

In [26]:
df

    w   x   y   z
a   2  79  -8 -86
b   6 -29  88 -80
c   2  21 -26 -13
d  16  -1   3  51
e  30  49 -48 -99

In [27]:
df['x']>0

a     True
b    False
c     True
d    False
e     True
Name: x, dtype: bool

In [29]:
df[df['x']>0] #Conditional selection in pandas

    w   x   y   z
a   2  79  -8 -86
c   2  21 -26 -13
e  30  49 -48 -99

In [30]:
df[df['x']>0].iloc[0]

w     2
x    79
y    -8
z   -86
Name: a, dtype: int32

In [31]:
df[(df['w']>0) & (df['y']>1)]

#(df['w']>0) | (df['y']>1)  for either condition

    w   x   y   z
b   6 -29  88 -80
d  16  -1   3  51

In [32]:
df.reset_index()

  index   w   x   y   z
0     a   2  79  -8 -86
1     b   6 -29  88 -80
2     c   2  21 -26 -13
3     d  16  -1   3  51
4     e  30  49 -48 -99

In [41]:
new_ind = ['CA','NY','WY','OR','CO']
df['States'] = new_ind

In [42]:
df

         w   x   y   z States
States
CA       2  79  -8 -86     CA
NY       6 -29  88 -80     NY
WY       2  21 -26 -13     WY
OR      16  -1   3  51     OR
CO      30  49 -48 -99     CO

In [43]:
df = df.set_index('States') #setting the states as index
df

         w   x   y   z
States
CA       2  79  -8 -86
NY       6 -29  88 -80
WY       2  21 -26 -13
OR      16  -1   3  51
CO      30  49 -48 -99

In [44]:
df.columns

Index(['w', 'x', 'y', 'z'], dtype='object')

In [45]:
df.describe()

              w          x          y          z
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000
std    11.96662  42.109381  51.915316  63.366395
min     2.00000 -29.000000 -48.000000 -99.000000
25%     2.00000  -1.000000 -26.000000 -86.000000
50%     6.00000  21.000000  -8.000000 -80.000000
75%    16.00000  49.000000   3.000000 -13.000000
max    30.00000  79.000000  88.000000  51.000000

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   w       5 non-null      int32
 1   x       5 non-null      int32
 2   y       5 non-null      int32
 3   z       5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [47]:
##########################################################################
##########################################################################

#                    PANDA MISSING DATA                             #

In [49]:
dataf = pd.DataFrame({'A':[1,2,np.nan,4],
                  'B':[5,np.nan,np.nan,8],
                  'C':[10,20,30,40]})

In [50]:
dataf

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [51]:
# Removing missing data
dataf.dropna()

     A    B   C
0  1.0  5.0  10
3  4.0  8.0  40

In [53]:
dataf.dropna(1)

    C
0  10
1  20
2  30
3  40

In [56]:
dataf.dropna(axis=1,thresh=3)

     A   C
0  1.0  10
1  2.0  20
2  NaN  30
3  4.0  40

In [57]:
#FIlling missing data

In [58]:
dataf

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [60]:
dataf.fillna(value='filled')

        A       B   C
0     1.0     5.0  10
1     2.0  filled  20
2  filled  filled  30
3     4.0     8.0  40

In [61]:
dataf.fillna(value=0)

     A    B   C
0  1.0  5.0  10
1  2.0  0.0  20
2  0.0  0.0  30
3  4.0  8.0  40

In [62]:
dataf['A'] = dataf['A'].fillna(0)

In [63]:
dataf

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  0.0  NaN  30
3  4.0  8.0  40

In [64]:
dataf.fillna(dataf.mean()) #fills the missing data with the mean value

     A    B   C
0  1.0  5.0  10
1  2.0  6.5  20
2  0.0  6.5  30
3  4.0  8.0  40